test/k6/k6-output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 

     execution: local
        script: test/k6/load-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 10 max VUs, 1m0s max duration (incl. graceful stop):
              * default: 10 looping VUs for 30s (gracefulStop: 30s)


running (0m01.0s), 10/10 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 10 VUs  01.0s/30s

running (0m02.0s), 10/10 VUs, 10 complete and 0 interrupted iterations
default   [   7% ] 10 VUs  02.0s/30s

running (0m03.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [  10% ] 10 VUs  03.0s/30s

running (0m04.0s), 10/10 VUs, 20 complete and 0 interrupted iterations
default   [  13% ] 10 VUs  04.0s/30s

running (0m05.1s), 10/10 VUs, 30 complete and 0 interrupted iterations
default   [  17% ] 10 VUs  05.0s/30s

running (0m06.1s), 10/10 VUs, 40 complete and 0 interrupted iterations
default   [  20% ] 10 VUs  06.0s/30s

running (0m07.1s), 10/10 VUs, 50 complete and 0 interrupted iterations
default   [  23% ] 10 VUs  07.0s/30s

running (0m08.1s), 10/10 VUs, 60 complete and 0 interrupted iterations
default   [  27% ] 10 VUs  08.0s/30s

running (0m09.1s), 10/10 VUs, 70 complete and 0 interrupted iterations
default   [  30% ] 10 VUs  09.0s/30s

running (0m10.1s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  33% ] 10 VUs  10.0s/30s

running (0m11.1s), 10/10 VUs, 80 complete and 0 interrupted iterations
default   [  37% ] 10 VUs  11.0s/30s

running (0m12.1s), 10/10 VUs, 90 complete and 0 interrupted iterations
default   [  40% ] 10 VUs  12.0s/30s

running (0m13.1s), 10/10 VUs, 100 complete and 0 interrupted iterations
default   [  43% ] 10 VUs  13.0s/30s

running (0m14.1s), 10/10 VUs, 110 complete and 0 interrupted iterations
default   [  47% ] 10 VUs  14.0s/30s

running (0m15.1s), 10/10 VUs, 120 complete and 0 interrupted iterations
default   [  50% ] 10 VUs  15.0s/30s

running (0m16.1s), 10/10 VUs, 130 complete and 0 interrupted iterations
default   [  53% ] 10 VUs  16.0s/30s

running (0m17.1s), 10/10 VUs, 140 complete and 0 interrupted iterations
default   [  57% ] 10 VUs  17.0s/30s

running (0m18.1s), 10/10 VUs, 150 complete and 0 interrupted iterations
default   [  60% ] 10 VUs  18.0s/30s

running (0m19.1s), 10/10 VUs, 160 complete and 0 interrupted iterations
default   [  63% ] 10 VUs  19.0s/30s

running (0m20.1s), 10/10 VUs, 160 complete and 0 interrupted iterations
default   [  67% ] 10 VUs  20.0s/30s

running (0m21.1s), 10/10 VUs, 170 complete and 0 interrupted iterations
default   [  70% ] 10 VUs  21.0s/30s

running (0m22.1s), 10/10 VUs, 180 complete and 0 interrupted iterations
default   [  73% ] 10 VUs  22.0s/30s

running (0m23.1s), 10/10 VUs, 190 complete and 0 interrupted iterations
default   [  77% ] 10 VUs  23.0s/30s

running (0m24.1s), 10/10 VUs, 200 complete and 0 interrupted iterations
default   [  80% ] 10 VUs  24.0s/30s

running (0m25.1s), 10/10 VUs, 210 complete and 0 interrupted iterations
default   [  83% ] 10 VUs  25.0s/30s

running (0m26.1s), 10/10 VUs, 220 complete and 0 interrupted iterations
default   [  87% ] 10 VUs  26.0s/30s

running (0m27.1s), 10/10 VUs, 230 complete and 0 interrupted iterations
default   [  90% ] 10 VUs  27.0s/30s

running (0m28.1s), 10/10 VUs, 240 complete and 0 interrupted iterations
default   [  93% ] 10 VUs  28.0s/30s

running (0m29.1s), 10/10 VUs, 250 complete and 0 interrupted iterations
default   [  97% ] 10 VUs  29.0s/30s

running (0m30.1s), 10/10 VUs, 260 complete and 0 interrupted iterations
default   [ 100% ] 10 VUs  30.0s/30s

     ✓ homepage status is 200
     ✓ homepage loads in < 500ms
     ✓ recent topics status is 200

     checks.........................: 100.00% 810 out of 810
     data_received..................: 44 MB   1.4 MB/s
     data_sent......................: 73 kB   2.4 kB/s
     http_req_blocked...............: avg=60.71µs min=2.39µs   med=5.8µs   max=4.73ms   p(90)=10.08µs p(95)=14.45µs 
     http_req_connecting............: avg=18.75µs min=0s       med=0s      max=2.53ms   p(90)=0s      p(95)=0s      
     http_req_duration..............: avg=66.65ms min=7.56ms   med=58.03ms max=335.73ms p(90)=92.53ms p(95)=149.35ms
       { expected_response:true }...: avg=66.65ms min=7.56ms   med=58.03ms max=335.73ms p(90)=92.53ms p(95)=149.35ms
     http_req_failed................: 0.00%   0 out of 540
     http_req_receiving.............: avg=6.31ms  min=187.25µs med=3.09ms  max=43.42ms  p(90)=18.17ms p(95)=26.12ms 
     http_req_sending...............: avg=32.16µs min=6.84µs   med=15.85µs max=1.87ms   p(90)=32.93µs p(95)=56.82µs 
     http_req_tls_handshaking.......: avg=0s      min=0s       med=0s      max=0s       p(90)=0s      p(95)=0s      
     http_req_waiting...............: avg=60.31ms min=7.01ms   med=52.12ms max=326.68ms p(90)=87.53ms p(95)=123.53ms
     http_reqs......................: 540     17.472546/s
     iteration_duration.............: avg=1.13s   min=1.02s    med=1.12s   max=1.65s    p(90)=1.21s   p(95)=1.25s   
     iterations.....................: 270     8.736273/s
     vus............................: 10      min=10         max=10
     vus_max........................: 10      min=10         max=10


running (0m30.9s), 00/10 VUs, 270 complete and 0 interrupted iterations
default ✓ [ 100% ] 10 VUs  30s